<?php

use Illuminate\Database\Seeder;

class FaqTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $faqs = [
            'چطور می توانم سفارش خود را در سایت ثبت کنم' => 'در صفحه نخست با کلیک بر روی کلید ثبت سفارش یا پس از ثبت نام در سایت می توانید از طریق پروفایل خود سفارش خود را ثبت کنید',
            'قیمت گذاری سفارشات به چه صورتی انجام می پذیرد' => 'برای اینکه حق مشتری و مترجمان حفظ شود قیمت گذاری سفارشات ارسالی بر اساس تعداد کلمات انجام می شود',
            'نحوه شروع همکاری با مجموعه شما چگونه است' => 'در قسمت همکاری با ما پس از تکمیل فرم و انجام نمونه ترجمه آنلاین، درخواست شما توسط مسئول مترجمان بررسی شده و در صورت کسب امتیاز لازم همکاری شما با مجموعه آغاز می گردد',
        ];


        foreach ($faqs as $q => $a) {
            DB::table('faqs')->insert([
                'q' => $q,
                'a' => $a,
            ]);
        }
    }
}