<?php

use Illuminate\Database\Seeder;
use App\Language;
use App\TranslationField;
use App\Quiz;

class QuizAnswersTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
//        $quizzes_id = Quiz::get()->pluck('id');
//        $dest_langs_id = Language::get()->pluck('id');
//

        //for quantification of quizzes Answers table with array of texts in various courses
//        SourceLanguage=>DestLang=>field=>text=>Answer
        $QuizzesAnswers = [
//            source lang=English
            1 => [
//              dest lang=Persian
                6 => [
//                    field= ادبیات و زبان شناسی
                    1 => [
                        [
                            'text_id' => '1',
                            'quiz_answer' => 'تامی فریاد زد "چی ؟ من چه کار کردم ؟ " از روی درماندگی صورتش دچار تیک شد.ضربه پنالتی توسط همه افراد برای تیم رودی تعیین شد و رودی استینر درمقابل بچه جدید یعنی لیزل ممینگر قرار گرفت. رودی توپ را روی توده برفی کثیف قرار داد در حالی که از نتیجه معمول مطمئن بود. هرچه باشد رودی در هیجده شوت یک ضربه پنالتی هم از دست نداده بود. حتی وقتی تیم حریف عمداً تامی مولر را با اردنگی از دروازه بیرون کرد. اهمیتی نداشت که چه کسی را جای او می گذاشتند، رودی گُل می زد. در این موقع آنها سعی کردند لیزل را بزور بیرون کنند. طبق تصور ، او اعتراض کرد و رودی موافق اعتراض او بود.  او لبخند زد " نه  نه   بگذارید بماند". او دستانش را به هم می مالید.',
                        ],
                        [
                            'text_id' => '2',
                            'quiz_answer' => 'چیرگی روایت سنتی در سینمای ترکیه همواره مشهود بوده است. بزرگترین تفاوت میان روایت سنتی و مدرن، ساختارهای روایی مدرن هستند که مقاصد تجاری دارند و بر آن هستند تا هویت ارائه و در طول فیلم مخاطب را از دنیای واقعی جدا کنند. کارگردانان سینمای ترکیه مانند عمر لطفی آکاد، ییلماز گونی و متین ارکسان برای رهایی از نفوذ یشیل چام و گذار از ساختار ملودراماتیک، فیلم هایی با مضمون اجتماعی ساخته‌اند. یشیل چام نام خیابانی در استانبول است که اولین شرکت‌های فیلم‌سازی ترکیه در آن تاسیس شدند؛ به همین دلیل به صنعت فیلم‌سازی در ترکیه یشیل چام گفته می‌شود.',
                        ],
                        [
                            'text_id' => '3',
                            'quiz_answer' =>'انتشار نتایج تحقیق بخش ضروری زندگی حرفه ای یک محقق است. به هر حال، نگارش فعالیت مورد علاقه هر محققی نیست و موانعی در راه انتشار مقاله وجود دارند که رفع آنها می تواند دشوار باشد. این مقاله یک گزارش مقدماتی در مورد مسائل مبانی نگارش و سازماندهی مقالات علمی و چاپ و نشر آنها را ارائه می دهد. این مقاله همچنین شکل اجمالی روند انتشار مقالات علمی در ژورنالها و شرح مذاکرات کنفرانس را نشان می دهد که هدف از آن ارائه رهنمودهای مقدماتی برای افراد مبتدی علاقمند است.',
                        ],
                        [
                            'text_id' => '4',
                            'quiz_answer' => 'هدف از این مقاله ارائه یک گزارش مقدماتی در مورد اصول نگارش و سازماندهی مقالات علمی و همچنین پروسه چاپ مقاله در یک مجله یا شرح مذاکرات کنفرانس می باشد. این باید برای افراد مبتدی (مثلا دانشجویان دکترا) که به دنبال پیوستن به جامعه انتشارات علمی هستند، مفید باشد. از آنجاییکه کل دامنه این موضوع بسیار پیچیده است و بحث دقیق در مورد دامنه این مقاله مختصر بسیار وسیع است، همه جوانب نگارش و انتشار مقالات علمی با دقت مناسبی در اینجا در نظر گرفته نشده اند. به هر حال، این مقاله شامل فهرستی از منابع سودمند می باشد که می تواند برای خوانندگان علاقمند به جزئیات در منابع آنلاین و چاپ شده مورد استفاده قرار گیرد، درجاییکه من بشدت دو اثر برجسته را توصیه می کنم: “چگونگی نوشتن و انتشار یک مقاله علمی از Robert Day ، و “نگارش علمی موفقیت آمیز از Meave O’Connor که باید به بیشتر سوالات در مورد این عنوان پاسخ دهند.',
                        ],
                        [
                            'text_id' => '5',
                            'quiz_answer' =>'از بین تمام صنایع ادبی، ژانر شعر هجو قسمت کاملاً خلاقانه زبان انسان است. همان طور که مشاهده می‌کنید بسیاری از این اشعار، کلمات جدیدی را در زبان خود خلق کرده‌اند، اما فقط شاعران توانسته‌اند که واقعاً هجو تولید کنند. با این حال، هنوز هم یک نماد شناخته شده توسط بسیاری از انسان ها که با ریاضی آشنا هستند اینطور نیست که این شاعران توانایی های خود را برای خلاقیت به طور کامل استفاده نمی کنند؛ بلکه آنها محدودیت های زبان انسانی و خودشان را محدود می کنند.
شاعران انگلیسی زبان با اختیار خویش زبان انسانی را انتخاب نکرده‌اند. با کار بر روی املای زبانشان، به منظور ارائه کلمات بی معنا می‌بایست از الفبای انگلیسی استفاده کنند. تنها برگس توانست بیرون از دنیای الفبا قدم بگذارد و از علائم ریاضی استفاده کند. شعر، حتی شعر بی معنا، برای این که بتواند خوانده شود، شاعر می‌بایست از الفبا آشنای خوانندگان بهره ببرد.
',
                        ],
                        [
                            'text_id' => '6',
                            'quiz_answer' =>'همان طور که دیده شده، رویکردی که ما دنبال می کنیم کاملاً کمینه گرا است که در آن حرکت آلفا یک ویژگی ضروری در اشتقاق جملات SV در SA است. علاوه بر این، این رویکرد با معرفی اینکه جهت یک ویژگی ارزش گذاری شده (- معلوم) دارد، ماهیت مجهول سازی را در SA بیان می کند و میان وندهای مجهول به عنوان مشخص گر آن توسط فعل برداشته می شود. ما معتقدیم که این رویکرد می¬تواند به سایر بافت¬ها گسترش یابد که مجهول¬ها در SA در مجهول های حرف‌اضافه‌ای و مجهول هایی با حالت دهنده اتفاق می افتند.',
                        ],
                        [
                            'text_id' => '7',
                            'quiz_answer' =>'نظریه ادبی چیست؟ چگونه ایجاد شده است؟ چه کاری انجام می دهد؟ چرا مهم می باشد و یا برای چه چیزی مناسب می باشد؟ مباحث مربوط به آن چه چیزهایی هستند هستند و چرا در برابر آن مقاومت می شود؟ آیا نظریه ادبی در واقع یک کلمه یا پدیده قابل تعریف می باشد؟ تمام این پرسش ها عمقی بوده و می بایست تحت بررسی قرار گیرند ، پاسخ به هیچ یک از آن ها آسان نمی باشد، و مطمئنادر یک پیشگفتار یا مقدمه خلاصه نمی شوند. اما من می خواهم با چند پاسخ مفصل کار خود را آغاز کنم.',
                        ],

                    ],
//              ---------------------------  END OF FIELD ادبیات و زبان شناسی ----------------------------------

//                    field= کامپیوتر و آی تی
                21=>[
                    [
                        'text_id' => '1',
                        'quiz_answer' =>'پیاده سازی تگ های RFID فراگیر و ارزان قیمت تر شده است. اغلب طراحی پروتکل های بسیار سبک تایید هویت برای چنین تگ هایی الزامی است. بسیاری از پروتکل های موجود همچنان بر توابع مثلثی تکیه دارند که دارای آسیب پذیری های امنیتی و حریم خصوصی هستند. این مقاله پروتکل بسیار سبک تایید هویت متقابل مبتنی بر روش به اشتراک گذاری کلید مخفی Shamir (UMAPSS) را پیشنهاد می دهد. این پروتکل دربرگیرنده مکانیزم هایی برای تایید دوگانه ، کنترل جلسه ، تایید هویت متقابل و به روز رسانی پویا به منظور ارتقاء امنیت است و از حریم خصوصی حفاظت می کند. این پروتکل بر دو عملیات ساده بیتی به نام های افزایش مبنای ۲ یعنی ۲m و تغییر چرخشی Rot (x,y) استوار است.
تحلیل امنیتی نشان می دهد که این پروتکل دارای ویژگی های بسیار خوبی از نظر حریم خصوصی است و در عین حال حفاظت قدرتمندی را در برابر طیف وسیعی از حملات متداول ارائه می کند. این پروتکل امنیت معمول و الزامات کم هزینه را برای تگ های RFID فراهم می کند. همچنین نسبت به پروتکل های موجود دارای مزیت رقابتی است و امتیاز بالاتری از نظر هزینه محاسبات، ذخیهر سازی و سربار ارتباطی دارد.
',
                    ],
                    [
                        'text_id' => '2',
                        'quiz_answer' =>'به منظور غلبه بر ضعف های شناخته شده امنیتی و یا نبود حریم خصوص در پروتکل های قبلی تایید هویت، پروتکل UMPASS پیشنهاد داده شده است. این پروتکل الگوریتم به اشتراک گذاری(2,n)  مربوط به Shamir را به کار می گیرد و به بهبود امنیتی قابل توجهی دست می یابد. این پروتکل حفاظت قدرتمندی را از طریق مکانیزم های تایید هویت متقابل و دوگانه فراهم می کند. این پروتکل حذف امنیت اضافه کار را با استفاده از مکانیزم کنترل جلسه کاهش می دهد و قابلیت تفکیک و تصادفی سازی را با به کارگیری مکانیزم به روز رسانی پویا تضمین می کند. پروتکل UMPASS براساس مشخصات امنیتی و توانایی مقاومت در مقابل حملات مخرب عملکرد مطلوبی دارد. این پروتکل بسیار سبک وزن است و تنها به دو عملیات بیتی ساده بر روی تگ های کم هزینه RIFD بدون افزایش قابل توجه بار در تگ و سرور نیاز دارد. این پروتکل عملیات توابع مثلثی را از بین می برد و کمتر در معرض مسائل امنیتی قرار می گیرد. پروتکل UMPASS توازنی میان عملکرد برتر امنیتی و رقابت عملیاتی ایجاد می کند.',
                    ],
                    [
                        'text_id' => '3',
                        'quiz_answer' =>'مکانیسم قابلیت تحلیل کسب و کار با بهبود مدیریت امنیت داده های رایانش ابری، یکی از پیشایندهای کلیدی برای بهبود امنیت رایانش ابری محسوب می گردد. براساس نظریه زنجیره ارزش اطلاعات و نظریه قابلیت IT، یک مدل تحقیقاتی پژوهشی ساخته شده است تا مکانیسم پایه قابلیت تحلیل کسب و کار با بهبود مدیریت امنیت داده های رایانش ابری را مورد پژوهش قرار دهد. مدل پیشنهادی شامل قابلیت تحلیل کسب و کار، قابلیت تصمیم گیری در زمینه امنیت داده های رایانش ابری، عقلانیت تصمیم گیری در زمینه امنیت داده های رایانش ابری، و مدیریت امنیت داده های رایانش ابری می باشد. ضمناً، مدل پیشنهادی، نقش فرهنگ داده محور و یکپارچگی فرایند کسب و کار IT را مد نظر قرار می دهد. مدل مذکور، به روش تجربی و با استفاده از داده های جمع آوری شده از ۳۱۶ موسسه با مدل معادله ساختاری مبتنی بر حداقل مربعات جزئی تست گردید. بدون فرهنگ داده محور و یکپارچگی فرایند کسب و کار IT، نتایج بدست آمده حاکی از آن است که فرایندی از قابلیت تحلیل کسب کار تا قابلیت تصمیم گیری د ر زمینه امنیت داده های رایانش ابری، عقلانیت تصمیم گیری در زمینه امنیت داده های رایانش ابری و مدیریت امنیت داده های رایانش ابری وجود دارد. به علاوه، فرهنگ داده محور و یکپارچگی فرایند کسب و کار IT، بر رابطه بین قابلیت تحلیل کسب و کار و قابلیت تصمیم گیری در زمینه امنیت داده های رایانش ابری، اثر واسطه ای مثبتی دارند. نتایج این مطالعه، منابع مهمی در اختیار موسسه قرار می دهد تا به این طریق مدیریت امنیت داده ها رایانش ابری را با استفاده از تحلیل کسب و کار تقویت نماید.',
                    ],
                    [
                        'text_id' => '4',
                        'quiz_answer' =>'نتایج بدست آمده برخی مبانی عملی مهم نیز برای MCCDS ارائه می دهد. (۱) نتایج بدست آمده به موسسه در بهبود منطقی MCCDS بااستفاده از تحلیل کسب و کار کمک می کند. هرچند تحقیق موجود نشان می دهد که تصمیم گیری منطقی مبتنی بر تحلیل کسب و کار بهتر از تصمیم گیری شهودی مبتنی بر تجربه است، اما در مورد چگونگی راهنمایی موسسه در راستای بهبود منطقی MCCDS با استفاده از تحلیل کسب و کار تحقیقاتی انجام نشده است. به خاطر کمبود تجربه، زمان و انرژی برای موسسه جهت بهبود MCCDS با استفاده از تحلیل کسب و کار، مطالعه حاضر براساس قابلیت های IT، انجام می شود. به طور همزمان، نتایج بدست آمده به موسسه درزمینه جستجو، توضیح، ارزیابی و شناسایی نیازمندیهای امنیتی داده ها با استفاده از تحلیل کسب و کار و سپس به موسسه در زمینه بهبود DRC و بهبود منطقی MCCDS با استفاده از تحلیل کسب و کار کمک می کند. (۲) نتایج بدست آمده موسسه را در راستای توجه به نقش DDC و IBI، راهنمایی می کند.',
                    ],
                ],
//              ---------------------------  END OF FIELD کامپیوتر و آی تی ----------------------------------
//                    field= مدیریت
                24=>[
                    [
                        'text_id' => '1',
                        'quiz_answer' =>'در کره، مراکز خرده فروشی سنتی با یک وضعیت جدی مواجه هستند که به موجب آن کسب و کارهای مناطق پایین دست با کاهش جمعیت محلی با فروپاشی مواجه می‌شوند: و این امر منجر به کاهش در فروش خویش فرمایان و رکود اقتصاد محلی می‌شود. خرده فروشان سنتی از حسابداری مبهمی استفاده می‌کنند و تمایلی به استفاده از کارتهای اعتباری ندارند، و بنابراین قابلیت اطمینان کلی داده‌های مربوط به مشتریان آنها پایین است. این مقاله، این مسئله را با استفاده از مفهوم ارزش ویژه مشتری (CE) حل می‌کند. ما از طریق پرسشنامه‌ها، یک تجزیه و تحلیل تجربی را انجام دادیم تا تفاوتهای موجود در ارزش ویژه مشتری (CE) را بین قالبهای خرده فروشی سنتی و جدید شناسایی کنیم. این پرسشنامه شامل سوالاتی در رابطه با CE (ارزش ویژه، ارزش برند، ارزش رابطه)، رضایت، وفاداری و ویژگیهای جمعیت شناختی بود. ارزش ویژه مشتری (CE) و رضایتمندی در مقیاس ۵ نمره‌ای لیکرت اندازه گیری شد. در مجموع ۴۰۰ نظرسنجی تکمیل شد که از این میان ۳۹۱ مورد برای تجزیه و تحلیل در این مطالعه قابل استفاده بودند. در تحلیل رگرسیون بین ارزش ویژه مشتری (CE) و رضایتمندی مشتری، هر دو شرکت خرده فروشی قدیمی و جدید اثرات آماری معنی داری را نشان دادند. در صنعت خرده فروشی سنتی، ارزش ویژه و ارزش برند به لحاظ آماری معنی دار بودند، در حالیکه ارزش رابطه اینچنین نبود.',

                    ],
                    [
                        'text_id' => '2',
                        'quiz_answer' =>'این مطالعه دارای محدودیت‌های زیر می‌باشد. این مقاله از نظریه ارزش ویژه مشتری (CE) در زمینه توزیع خرده فروشی استفاده کرده است و از نظر تجربی به گسترش نظری آن کمک کرده است، اما هنوز هم محدودیتهایی دارد. در این مقاله زمینه‌های مختلفی مانند مراکز خرید بزرگ، خوار و بار فروشیهای کوچک و مراکز خرید آنلاین مشاهده می‌شوند که تنها دو مورد تجزیه و تحلیل شدند. دوما، Nam و همکاران (۲۰۱۱) خاطرنشان كردند كه با توجه به محدوديت تعداد پاسخ دهندگان در نظرسنجي، نتایج اين مقاله نمی‌تواند كل صنعت توزیع را نشان دهد. بنابراین، در تحقیقات بعدی لازم است که با گسترش ناحیه هدف نظرسنجی و انجام تحقیقات، نمونه‌ای تهیه شود که بتواند نمایانگر کل کشور و کل صنعت توزیع باشد. در آن صورت، می‌توان نتایج تحقیق را که نمایانگر کل کشور و کل صنعت توزیع است ارائه کرد که برای تحقیقات بعدی بسیار مفید خواهد بود. نتیجه گیری این است که مطالعات بعدی برای یکی کردن فروشگاه‌های خرده فروشی مختلف مانند فروشگا های بزرگ و یا خوار و بار فروشی برای دسترسی به سطوح نسبی دلبستگی عاطفی یا تعهد مشتری لازم است که می‌تواند به ایجاد روابط بسیار بلند مدت و حمایت پایدار در خرده فروشی کمک کند.',

                    ],
                ],




                ],
//              ---------------------------  END OF DEST LANG PERSIAN ------------------------------------------

        ],
//              ---------------------------  END OF FIELD SOURCE LANG ENGLISH-----------------------------------

        ];


        foreach ($QuizzesAnswers as $source_lang_id => $dest_lang) {
            foreach ($dest_lang as $dest_lang_id => $field) {
                foreach ($field as $field_id => $text) {
                    foreach ($text as $item) {
                        DB::table('quiz_answers')->insert([
                            'SourceLanguageId' => $source_lang_id,
                            'destLanguageId' => $dest_lang_id,
                            'TranslationFieldId' => $field_id,
                            'TextId' =>$item['text_id'],
                            'AnswerText' => $item['quiz_answer'],
                        ]);
                    }
                }
            }
        }

    }
}
