{{--=================== Customer Guide  =================================--}}

<div class="box box-primary">
    <div class="box-header">
        <i class="ion ion-clipboard"></i>

        <h3 class="box-title">راهنما</h3>
        <!-- tools box -->
        <div class="pull-left box-tools">
            <!-- button with a dropdown -->
            <button type="button" class="btn btn-success btn-sm" data-widget="remove"><i
                    class="fa fa-times"></i>
            </button>
        </div>
        <!-- /. tools -->
    </div>
    <!-- /.box-header -->
    <div class="box-body">
        <!-- See dist/js/pages/dashboard.js to activate the todoList plugin -->
        <ul class="todo-list">
            <li>
                <!-- todo text -->
                <span class="text">ایجاد پروژه جدید</span>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. در این
                    صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان
                    مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
                    استفاده قرار گیرد.
                </p>
            </li>

            <li>
                <!-- todo text -->
                <span class="text">مشاهده پیام ها</span>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. در این
                    صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان
                    مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
                    استفاده قرار گیرد.
                </p>
            </li>

            <li>
                <!-- todo text -->
                <span class="text">مشاهده فاکتورهای قابل پرداخت</span>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. در این
                    صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان
                    مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
                    استفاده قرار گیرد.
                </p>
            </li>

            <li>
                <!-- todo text -->
                <span class="text">ارتباط با واحد پشتیبانی</span>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. در این
                    صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان
                    مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
                    استفاده قرار گیرد.
                </p>
            </li>

        </ul>
    </div>
    <!-- /.box-body -->
</div>

{{--=================== End Of Customer Guide  =================================--}}
